ojc-core/bpelse/system-test/test/com/sun/jbi/engine/bpel/jbiadaptor/test/bpeldebugger/bpels/flowFirstActivityAndAnotherFlow/flowFirstActivityAndAnotherFlow/src/flowFirstActivityAndAnotherFlow.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="flowFirstActivityAndAnotherFlow" targetNamespace="http://j2ee.netbeans.org/wsdl/flowFirstActivityAndAnotherFlow"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:plink="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:tns="http://j2ee.netbeans.org/wsdl/flowFirstActivityAndAnotherFlow" xmlns:ns="http://xml.netbeans.org/schema/purchaseOrder">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/flowFirstActivityAndAnotherFlow">
            <xsd:import namespace="http://xml.netbeans.org/schema/purchaseOrder" schemaLocation="purchaseOrder.xsd"/>
        </xsd:schema>
    </types>
    <message name="flowFirstActivityAndAnotherFlowOperationRequest">
        <part name="part1" element="ns:purchaseOrder"/>
    </message>
    <portType name="flowFirstActivityAndAnotherFlowPortType">
        <operation name="flowFirstActivityAndAnotherFlowOperation">
            <input name="input1" message="tns:flowFirstActivityAndAnotherFlowOperationRequest"/>
        </operation>
    </portType>
    <portType name="flowFirstActivityAndAnotherFlowPortTypeReponse">
        <operation name="flowFirstActivityAndAnotherFlowOperation">
            <input name="input1" message="tns:flowFirstActivityAndAnotherFlowOperationRequest"/>
        </operation>
    </portType>
    <binding name="flowFirstActivityAndAnotherFlowBinding" type="tns:flowFirstActivityAndAnotherFlowPortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="flowFirstActivityAndAnotherFlowOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal"/>
            </input>
        </operation>
    </binding>
    <service name="flowFirstActivityAndAnotherFlowService">
        <port name="flowFirstActivityAndAnotherFlowPort" binding="tns:flowFirstActivityAndAnotherFlowBinding">
            <soap:address location="http://localhost:18181/flowFirstActivityAndAnotherFlowService/flowFirstActivityAndAnotherFlowPort"/>
        </port>
    </service>
    <plink:partnerLinkType name="flowFirstActivityAndAnotherFlowPartner">
        <!-- partnerLinkType are automatically generated when a new portType is added. partnerLinkType are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plink:role name="flowFirstActivityAndAnotherFlowPortTypeRole" portType="tns:flowFirstActivityAndAnotherFlowPortType"/>
    </plink:partnerLinkType>
    <plink:partnerLinkType name="flowFirstActivityAndAnotherFlowResponsePartner">
        <!-- partnerLinkType are automatically generated when a new portType is added. partnerLinkType are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plink:role name="flowFirstActivityAndAnotherFlowPortTypeReponseRole" portType="tns:flowFirstActivityAndAnotherFlowPortTypeReponse"/>
    </plink:partnerLinkType>
</definitions>
