driver-tests/bpelse/benchmark/purchaseOrderCoordinatorJBI/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pur="http://xml.netbeans.org/schema/purchaseOrder">
    <soapenv:Body>
        <pur:purchaseOrder orderDate="2006-11-07">
            <pur:customer>
                <pur:name>John Doe</pur:name>
                <pur:address country="US">
                    <pur:name>John Doe</pur:name>
                    <pur:street>123 Main street</pur:street>
                    <pur:city>Monrovia</pur:city>
                    <pur:state>CA</pur:state>
                    <pur:zip>91016</pur:zip>
                </pur:address>
            </pur:customer>
            <pur:shipTo country="US">
                <pur:name>John Doe</pur:name>
                <pur:street>123 Main street</pur:street>
                <pur:city>Arcadia</pur:city>
                <pur:state>CA</pur:state>
                <pur:zip>91007</pur:zip>
            </pur:shipTo>
            <pur:billTo country="US">
                <pur:name>John Doe</pur:name>
                <pur:street>123 Main street</pur:street>
                <pur:city>Duarte</pur:city>
                <pur:state>CA</pur:state>
                <pur:zip>91010</pur:zip>
            </pur:billTo>
            <pur:comment>Order my books</pur:comment>
            <pur:lineItems>
                <pur:item partNum="123">
                    <pur:productName>Book1</pur:productName>
                    <pur:quantity>1</pur:quantity>
                    <pur:USPrice>50.00</pur:USPrice>
                    <!--Optional:-->
                    <pur:comment>by Abc</pur:comment>
                    <!--Optional:-->
                    <pur:shipDate>2006-12-02</pur:shipDate>
                </pur:item>
            </pur:lineItems>
        </pur:purchaseOrder>
    </soapenv:Body>
</soapenv:Envelope>